<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7ba83b53b0e528bd839d63fd5657f676646434c43f010a363adfea0fbcf0ccc1","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1364 at https://github.com/cal-itp/data-infra/actions/runs/21017341211","plan_out_hash":"79eda4f63fe3b8536f8dd1ec7604101c4aa7ced439022d9932e93c437a07cc76","plan_hash":"2d2a444db5ea5aff7ab38495b3879503933475260a18a0665986ec8c9a76702d","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "jDUklA==" -> (known after apply)
!~      detect_md5hash      = "QhlGZ4zt38eRAL4gsamA6w==" -> "different hash"
!~      generation          = 1768254228612904 -> (known after apply)
        id                  = "calitp-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "QhlGZ4zt38eRAL4gsamA6w==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "rVwKBg==" -> (known after apply)
!~      detect_md5hash      = "ZPPfqOtulC/YbCSfKMWbYA==" -> "different hash"
!~      generation          = 1768254228638723 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "ZPPfqOtulC/YbCSfKMWbYA==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1364](https://github.com/cal-itp/data-infra/actions/runs/21017341211)